Sandgreenpanda/2026-ESP32/src/main.cpp
#include "Arduino.h"
#include "HardwareSerial.h"
#include "WString.h"
#include "esp32-hal-ledc.h"
#include "esp32-hal.h"
#include "esp_task_wdt.h"
#include "libssh_esp32.h"
#include <HTTPRequest.hpp>
#include <HTTPResponse.hpp>
#include <HTTPSServer.hpp>
#include <SSLCert.hpp>
#include <WiFi.h>
#include <WiFiMulti.h>
#include <functional>
#include <libssh/libssh.h>
#include <lwip/sockets.h>
#include <sha/sha_parallel_engine.h>
#include <ssh_functions.h>

#include <FS.h>
#include <SD.h>
#include <SPI.h>
#define SD_MISO 16
#define SD_SCK 17
#define SD_MOSI 18
#define SD_CS 19

#define LAPTOP_HP_1 33
#define LAPTOP_HP_2 32
#define LAPTOP_HP_3 12
#define LAPTOP_LENOVO_1 27
#define LAPTOP_ACER_1 26
#define LAPTOP_ACER_2 25

#define PWM_FAN_1 23
#define TACH_FAN_1 22

// Max ssh clients. So fat this is for ne computer, so I may do different objs later.
// For now four is more than enough
#define MAX_CLIENTS 6

#define SSH_SINGLE_EXEC_TIMEOUT 10000 // 10s

boolean hp_1_status_req = false;
boolean hp_2_status_req = false;
boolean hp_3_status_req = false;
boolean acer_1_status_req = false;
boolean acer_2_status_req = false;

// Spi for the sd card file system
SPIClass sdSPI(VSPI);

// The HTTPS Server comes in a separate namespace. For easier use, include it here.
using namespace httpsserver;

WiFiMulti wifiMulti;

// Fan settings
const int PWM_FREQ = 25000; // 25 kHz frequency for computer fans
const int PWM_RESOLUTION = 8;
volatile unsigned long tachPulseCount = 0;
unsigned long lastTachTime = 0;
const unsigned long TACH_SAMPLE_TIME = 1000; // Sample period in milliseconds

// Interrupt service routine for tachometer
void IRAM_ATTR tachISR() {
    tachPulseCount = tachPulseCount + 1;
}

SSLCert *cert;
HTTPSServer *secureServer;

// Declare some handler functions for the various URLs on the server
void handleRoot(HTTPRequest *req, HTTPResponse *res);
void handle404(HTTPRequest *req, HTTPResponse *res);
void handleTerminal(HTTPRequest *req, HTTPResponse *res);
void handleTerminalPost(HTTPRequest *req, HTTPResponse *res);
void handleToggle1(HTTPRequest *req, HTTPResponse *res);
void handleSSHStatus1(HTTPRequest *req, HTTPResponse *res);
void handleToggle2(HTTPRequest *req, HTTPResponse *res);
void handleToggle3(HTTPRequest *req, HTTPResponse *res);
void handleToggle4(HTTPRequest *req, HTTPResponse *res);
void handleToggle5(HTTPRequest *req, HTTPResponse *res);
void handleToggle6(HTTPRequest *req, HTTPResponse *res);
void handleFan(HTTPRequest *req, HTTPResponse *res);
void handleStyle(HTTPRequest *req, HTTPResponse *res);
void handleTerminalUpdate(HTTPRequest *req, HTTPResponse *res);
void handleComputers(HTTPRequest *req, HTTPResponse *res);
void handleAdmin(HTTPRequest *req, HTTPResponse *res);
void handleLogIn(HTTPRequest *req, HTTPResponse *res);
void handleSSHpage(HTTPRequest *req, HTTPResponse *res);

void middlewareAuth(HTTPRequest *req, HTTPResponse *res, std::function<void()> next);

// List of clients that signed up for sse
std::vector<httpsserver::HTTPResponse *> sseClients;
// std::vector<int> sseClients;

const unsigned int configSTACK = 21200;

volatile devState_t devState;
volatile bool gotIpAddr, gotIp6Addr;
volatile bool wifiPhyConnected;

String ssh_command = "";
String shh_output_string = "";
String shh_output_send_temp_old = "";

String shh_output_send = "";
String shh_output_send_temp = "";

String PASSWORD = "OYW7]X}7:)[Z2T;l58-P6(P6+{21t0tF"; // This is NOT my password.
// This is a fallback for if the sd card does not load
// There is no way to not commit the fallback to github, by nature of it being a fallback
// I can't initialise it as an empty string, because in the case the SD card does not load,
// an empty string is not secure.

// SSH handler class
class SSHHandler : public WebsocketHandler {
  public:
    // This method is called by the webserver to instantiate a new handler for each
    // client that connects to the websocket endpoint
    static WebsocketHandler *create();

    // This method is called when a message arrives
    void onMessage(WebsocketInputStreambuf *input);

    // Handler function on connection close
    void onClose();
};

// Simple array to store the active clients:
SSHHandler *activeClients[MAX_CLIENTS];

class ssh_conn {
    // All my code :)
  private:
    char *host;
    char *user;
    char *password;
    ssh_channel channel;
    ssh_session session;

  public:
    boolean conn = false;

    ssh_conn(char *host, char *user, char *password) {
        this->host = host;
        this->user = user;
        this->password = password;
    }

    void brutal_exception() {
        ssh_channel_close(channel);
        ssh_channel_free(channel);
        ssh_disconnect(session);
        ssh_free(session);
        ssh_finalize();
    }

    ssh_channel connect() {
        // Except for this bit ;)

        int rc;
        libssh_begin();
        session = connect_ssh(password, host, user, 0);
        // session = connect_ssh("password", "test.rebex.net", "demo", 0);

        if (session == NULL) {
            Serial.println("FAILURE! finalizeing...");
            ssh_finalize();
            return NULL;
        }

        channel = ssh_channel_new(session);

        rc = ssh_channel_open_session(channel);
        if (rc != SSH_OK) {
            Serial.println("Open Fail");
            this->brutal_exception();
            return NULL;
        }

        rc = ssh_channel_request_pty(channel);
        if (rc != SSH_OK) {
            Serial.println("Request Fail");
            this->brutal_exception();
            return NULL;
        }
        rc = ssh_channel_change_pty_size(channel, 100, 30);
        if (rc != SSH_OK) {
            Serial.println("Resize Fail");
            this->brutal_exception();
            return NULL;
        }
        rc = ssh_channel_request_shell(channel);
        if (rc != SSH_OK) {
            Serial.println("Shell Fail");
            this->brutal_exception();
            return NULL;
        }
        return channel;
    }

