Sandgreenpanda/2026-ESP32/src/main.cpp
    int read() {
        char buffer[256];
        int rbytes;

        shh_output_send_temp = "";
        rbytes = ssh_channel_read_nonblocking(channel, buffer, sizeof(buffer), 0);

        if (rbytes > 0) {

            std::string msg(buffer, rbytes);
            for (int i = 0; i < MAX_CLIENTS; i++) {
                if (activeClients[i] != nullptr) {
                    // Serial.print("THIS +");
                    Serial.println(msg.c_str());
                    activeClients[i]->send(msg, WebsocketHandler::SEND_TYPE_TEXT);
                }
            }
        };
        return rbytes;
    }

    void write(String command) {
        Serial.println("ssh cmd received:");
        Serial.println(command);
        ssh_channel_write(channel, command.c_str(), command.length());
        Serial.println("ssh command processing finished");
    }

    void keep_alive() {
        ssh_send_ignore(session, "keepalive");
    }

    String exec_cmd(String command) {
        ssh_channel channel_oneoff = NULL;
        int rc;
        int nbytes;
        char buffer[256];
        String ssh_output = "";

        channel_oneoff = ssh_channel_new(session);
        if (channel_oneoff == NULL)
            return "-1"; // SSH ERROR

        rc = ssh_channel_open_session(channel_oneoff);
        if (rc != SSH_OK) {
            ssh_channel_free(channel_oneoff);
            return String(rc);
        }

        rc = ssh_channel_request_exec(channel_oneoff, command.c_str());
        if (rc != SSH_OK) {
            ssh_channel_close(channel_oneoff);
            ssh_channel_free(channel_oneoff);
            return String(rc);
        }

        unsigned long startTime = millis();

        while (ssh_channel_is_open(channel_oneoff) && !ssh_channel_is_eof(channel_oneoff)) {
            nbytes = ssh_channel_read_nonblocking(channel_oneoff, buffer, sizeof(buffer), 0);

            if (nbytes > 0) {
                ssh_output += String(buffer, nbytes);
                startTime = millis();
            } else if (nbytes == SSH_ERROR) {
                return "-1"; // SSH ERROR
            }

            if (millis() - startTime > SSH_SINGLE_EXEC_TIMEOUT) {
                Serial.println("Command timed out waiting for EOF!");
                break;
            }
            vTaskDelay(1 / portTICK_PERIOD_MS);
        }

        nbytes = ssh_channel_read_nonblocking(channel_oneoff, buffer, sizeof(buffer), 0);

        if (nbytes > 0) {
            ssh_output += String(buffer, nbytes);
            startTime = millis();
        } else if (nbytes == SSH_ERROR) {
            return "-1"; // SSH ERROR
        }

        ssh_channel_close(channel_oneoff);
        ssh_channel_free(channel_oneoff);

        return ssh_output;
    }

    void disconnect() {
        ssh_disconnect(session);
        ssh_free(session);
        ssh_finalize();
    }
};

ssh_conn hp_1_session("10.47.0.236", "alext", "Home1918");

int ex_main() {
    Serial.println("Exec main begin");
    ssh_session session = NULL;
    ssh_channel channel = NULL;

    int nbytes;
    int nwritten;

    int writeBufferSize;

    int lastHandleKeepAlive = millis();

    // Temporarily using test server
    // session = connect_ssh("Home1918", "10.47.1.39", "alext", 0);

    if (hp_1_session.connect() != NULL) {
        hp_1_session.conn = true;
    }

    Serial.println("loop begin");
    while (1) {

        // Read the ssh data and send it to the websocket clients
        if (!hp_1_session.conn || hp_1_session.read() < 1) { // Returns rbytes, checks for no-bytes-transferred/error
            // If the connection is down, dont read by short circuit evaluation
            vTaskDelay(1 / portTICK_PERIOD_MS);
        }

        if (ssh_command != "" && hp_1_session.conn) {
            // Write the websocket data to ssh
            hp_1_session.write(ssh_command);
            ssh_command = ""; // Reset command to prevent infinite loop

        } else if (hp_1_status_req) {
            String cmd_output = hp_1_session.exec_cmd("echo alive");
            cmd_output.trim();
            hp_1_session.conn = (cmd_output == "alive");
            Serial.println(cmd_output);
            if (!hp_1_session.conn) {
                Serial.println("HP1 Disconnect! Reconnecting...");
                // TODO: Reconnect logic for turn on

                // hp_1_session.connect();
                hp_1_session.brutal_exception();
                if (hp_1_session.connect() != NULL) {
                    hp_1_session.conn = true;
                } else {
                    hp_1_session.conn = false;
                }
            }
            hp_1_status_req = false;
        } else {
            if (millis() - lastHandleKeepAlive >= 10000 && hp_1_session.conn) { // Every 10 seconds
                Serial.println("Keep Alive Check");
                hp_1_session.keep_alive();
                lastHandleKeepAlive = millis();
            }
        }
    }
    hp_1_session.conn = true;
    hp_1_session.disconnect();

    return 0;
}

void controlTask(void *pvParameter) {
    wifiMulti.run();
    Serial.println("Wifi run finished");
    wait_for_wifi_exec(ex_main);
}

void serverTask(void *params) {
    // Server task in different thread on same core for async behavior.
    Serial.println("Creating a new self-signed certificate.");
    Serial.println("This may take up to a minute, so be patient ;-)");

    cert = new SSLCert();

    esp_task_wdt_delete(NULL);

    int createCertResult = createSelfSignedCert(
        *cert,
        KEYSIZE_2048,
        "CN=10.47.6.92,O=Sandgreenpanda,C=DE",
        "20190101000000",
        "20300101000000");

    esp_task_wdt_add(NULL);

    // Now check if creating that worked
    if (createCertResult != 0) {
        Serial.printf("Cerating certificate failed. Error Code = 0x%02X, check SSLCert.hpp for details", createCertResult);
        while (true)
            delay(500);
    }
    Serial.println("Creating the certificate was successful");

    secureServer = new HTTPSServer(cert, 443, MAX_CLIENTS);

    ResourceNode *nodeRoot = new ResourceNode("/", "GET", &handleRoot);
    ResourceNode *node404 = new ResourceNode("", "GET", &handle404);
    ResourceNode *nodeTerminal = new ResourceNode("/terminal", "GET", &handleTerminal);
    ResourceNode *nodeTerminalPost = new ResourceNode("/terminal_post", "POST", &handleTerminalPost);
    ResourceNode *nodeToggle1 = new ResourceNode("/toggle1", "POST", &handleToggle1);
    ResourceNode *nodeToggle2 = new ResourceNode("/toggle2", "POST", &handleToggle2);
    ResourceNode *nodeToggle3 = new ResourceNode("/toggle3", "POST", &handleToggle3);
    ResourceNode *nodeToggle4 = new ResourceNode("/toggle4", "POST", &handleToggle4);
    ResourceNode *nodeToggle5 = new ResourceNode("/toggle5", "POST", &handleToggle5);
    ResourceNode *nodeToggle6 = new ResourceNode("/toggle6", "POST", &handleToggle6);
    ResourceNode *nodeAdmin = new ResourceNode("/admin", "GET", &handleAdmin);
    ResourceNode *nodeLogIn = new ResourceNode("/admin", "POST", &handleLogIn);

    ResourceNode *nodeHandleFan = new ResourceNode("/fan", "POST", &handleFan);
    ResourceNode *nodeHandleStyle = new ResourceNode("/style.css", "GET", &handleStyle);
    ResourceNode *nodeHandleComputers = new ResourceNode("/computers", "GET", &handleComputers);

    ResourceNode *nodeHandleTerminalUpdate = new ResourceNode("/update", "GET", &handleTerminalUpdate);
    ResourceNode *nodehandleSSHpage = new ResourceNode("/sshpage", "GET", &handleSSHpage);
    WebsocketNode *sshNode = new WebsocketNode("/ssh", &SSHHandler::create);
    ResourceNode *nodeSSHStatus1 = new ResourceNode("/SSH1Status", "POST", &handleSSHStatus1);

